Tekla Open API Reference for Tekla Structures 2025
SinglePartDrawing.SheetNumber Property
 The sheet number of the drawing.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int SheetNumber { get; }
Public ReadOnly Property SheetNumber As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SinglePartDrawing Class
Tekla.Structures.Drawing Namespace